<p>&lt;img src="&#47;wp-content&#47;uploads&#47;2012&#47;07&#47;nyborjare-tips-tricks.png" alt="nyborjare-tips-tricks" width="695" height="182" class="alignnone size-full wp-image-3172" &#47;&gt;</p>
<h1 style="text-indent: -999px; height:0px">Tips och tricks&lt;&#47;h1&gt;
<h2>F-Layouten&lt;&#47;h2&gt;<br />
M&aring;nga har forskat i hur anv&auml;ndarens &ouml;ga f&ouml;ljer hemsidans layout. Man har tagit fram F-layouten, en bild av hur vi l&auml;ser av en hemsida. Man b&ouml;rjar alltid ifr&aring;n v&auml;nstra h&ouml;rnet, s&aring; det &auml;r allts&aring; d&auml;r du vill ha det viktigaste - loggan. Det &auml;r ocks&aring; viktigt att alltid l&auml;gga de &ouml;vergripande rubrikerna l&auml;ngst upp. Det ska d&auml;remot inte vara f&ouml;r mycket text i rubrikerna. Du ska vara rak p&aring; sak och det skadar aldrig att vara &ouml;vertydlig, annars slutar bes&ouml;karen att l&auml;sa.
<p>&lt;img class="alignnone size-full wp-image-981" title="" src="&#47;wp-content&#47;uploads&#47;2013&#47;02&#47;f-layout.png" alt="f-layout" width="696" height="368" &#47;&gt;</p>
<p>K&auml;lla: <a href="http:&#47;&#47;webdesign.tutsplus.com&#47;articles&#47;design-theory&#47;understanding-the-f-layout-in-web-design&#47;" target="_blank">Tuts+&lt;&#47;a&gt;
<h2>Saker du b&ouml;r undvika&lt;&#47;h2&gt;
<h3>iFrame&lt;&#47;h3&gt;<br />
Om du studerar webbdesign i din utbildning kan det h&auml;nda att dom kr&auml;ver att du kan iFrames. Visst, det kan vara praktiskt om du ska dela upp en sida f&ouml;r att sedan s&auml;tta ihop den, men det &auml;r inget man anv&auml;nder l&auml;ngre.
<h3>Skrikande f&auml;rger&lt;&#47;h3&gt;<br />
En hemsida blir aldrig bra med f&auml;rger som sk&auml;r sig mot bakgrunden eller i allm&auml;nhet sticker i &ouml;gonen. Kontrast &auml;r alltid bra att ha p&aring; hemsidan men f&ouml;rs&ouml;k att anv&auml;nda f&auml;rger som &auml;r v&auml;nliga mot &ouml;gat.
<h3>Font-taggar&lt;&#47;h3&gt;<br />
Taggen <font> &auml;r tabu, det &auml;r n&aring;got som kommer tas bort inom en framtid. D&auml;remot kan du anv&auml;nda <strong><span>&lt;&#47;strong&gt; f&ouml;r att markera en text, f&ouml;r att sedan f&auml;rgl&auml;gga texten med en style.
<p>[html]<br />
<span style="color: #fff;">Text&lt;&#47;span&gt;<br />
[&#47;html]
<h2>1-sekundsregeln&lt;&#47;h2&gt;<br />
P&aring; mindre &auml;n en sekund har din bes&ouml;kare gett sin uppfattning om hemsidan.<br />
Det g&auml;ller d&auml;rf&ouml;r att ge ett s&aring;nt bra intryck som m&ouml;jligt. F&ouml;rsta intrycket &auml;r som sagt viktigast!
<h2>S&aring; h&auml;r undviker du l&aring;nga laddningstider&lt;&#47;h2&gt;<br />
En annan tidsfaktor som &auml;r viktig &auml;r laddningstiden du har p&aring; hemsidan. Om bes&ouml;karen m&aring;ste v&auml;nta mer &auml;n 5 sekunder tr&ouml;ttnar han och surfar vidare.<br />
- Undvik h&ouml;guppl&ouml;sta bilder som tar mycket utrymme.<br />
- I Photoshop finns alternativet Spara f&ouml;r webb och enheter, v&auml;lj det om m&ouml;jligt.<br />
- Undvik text i bildformat. Det gynnar b&aring;de laddningstiden och s&ouml;koptimeringen om du skriver text som text.
</h2></h2></span></p></span></strong></font></h3></h3></h3></h2></a></p></h2></h1>
