<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan11.png" alt="" title="" width="700" height="400" class="alignnone size-full wp-image-2055" &#47;&gt;<br />
<strong>Att skapa den perfekta loggan kan vara kr&aring;ngligt, det finns trots allt en anledning till att stora f&ouml;retag l&auml;gger miljontals kronor p&aring; att skapa sitt varum&auml;rke. Men om&ouml;jligt &auml;r det inte, det g&auml;ller bara att t&auml;nka p&aring; vissa saker n&auml;r man skapar den, d&aring; &auml;r det snart dig de vill anlita n&auml;r varum&auml;rket beh&ouml;ver skapas eller f&ouml;rnyas.&lt;&#47;strong&gt;&lt;br&#47;&gt;
<p>Loggan &auml;r det som avg&ouml;r vilket f&ouml;rsta intryck man ska f&aring;. Den ska samtidigt ber&auml;tta en hel historia om vad f&ouml;retaget g&ouml;r. Den ska ge en varm k&auml;nsla i kroppen n&auml;r man ser den och du ska k&auml;nna en lycka varje g&aring;ng du m&ouml;ter den i vardagen, det ska n&auml;stan bli som en drog f&ouml;r konsumenten. Men k&auml;nn ingen press, h&auml;r kommer lite tips!</p>
<h2>Att f&ouml;rnya en logga&lt;&#47;h2&gt;<br />
Det &auml;r inte ofta man f&ouml;rnyar en logga eftersom det ligger en stor risk i det. Ett varum&auml;rke representerar hela f&ouml;retaget och &auml;r ansiktet ut&aring;t f&ouml;r det dom st&aring;r f&ouml;r. Ett minsta felsteg och f&ouml;retaget kan rasa ihop, <strong>om inte&lt;&#47;strong&gt; en reklamkampanj eller dylikt &auml;ger rum i samband med bytet. P&aring; s&aring; s&auml;tt byter man p&aring; ett s&auml;kert s&auml;tt ut f&ouml;reg&aring;ngaren med den nya.
<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan31.png" alt="Microsofts nya logga" title="" width="700" height="220" class="alignnone size-full wp-image-2049" &#47;&gt;<br />
Microsoft har bytt logotyp m&aring;nga g&aring;nger, men nu senast bytte dom den f&ouml;r f&ouml;rsta g&aring;ngen p&aring; 25 &aring;r.&lt;br&#47;&gt;</p>
<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan4.png" alt="" title="" width="700" height="220" class="alignnone size-full wp-image-2048" &#47;&gt;<br />
Apple har d&auml;remot inte bytt logga lika mycket, vilket kan vara smart d&aring; man undviker f&ouml;rvirring.&lt;br&#47;&gt;</p>
<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan5.png" alt="Telias nya logga" title="" width="700" height="220" class="alignnone size-full wp-image-2050" &#47;&gt;<br />
N&auml;r Telia bytte logga satsade dom stort p&aring; att marknadsf&ouml;ra den f&ouml;r att undvika f&ouml;rvirring och samtidigt visa ett nytt modernt utseende.</p>
<h2>Att skapa en helt ny logga&lt;&#47;h2&gt;<br />
Allting b&ouml;rjar med skisser, b&auml;sta s&auml;ttet &auml;r att skissa upp runt 100 olika f&ouml;rslag s&aring; kanske en eller tv&aring; blir bra.<br />
N&auml;r man k&auml;nner sig n&ouml;jd kan man scanna in skissen eller fota av den, f&ouml;r att sedan bearbeta loggan i ett bildhanteringsprogram. Den h&auml;r biten &auml;r viktig, man m&aring;ste n&auml;mligen skapa loggan i <strong><a href="&#47;kunnig-illustrator&#47;">vektor-format&lt;&#47;a&gt;&lt;&#47;strong&gt; f&ouml;r att f&ouml;retaget ska kunna jobba med bilden i efterhand utan n&aring;gra begr&auml;nsningar g&auml;llande storlek.
<h2>Jobba i Illustrator&lt;&#47;h2&gt;<br />
Att jobba i Illustrator &auml;r enkelt, allting handlar egentligen bara om punkter. Man beh&ouml;ver inte oroa sig &ouml;ver pixlar.<br />
Om du ska ta fram en logga kan det vara bra att hitta ett unikt typsnitt f&ouml;r just din id&eacute;. Det finns gratis fonter och det finns dom som kostar pengar. Dubbelkolla alltid n&auml;r du laddar ner en font att den verkligen &auml;r gratis att anv&auml;nda, du vill inte skapa ett varum&auml;rke &aring;t ett f&ouml;retag och sen uppt&auml;cka att den bryter mot upphovsr&auml;ttslagen.<br />
&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan2.png" alt="" title="" width="700" height="400" class="alignnone size-full wp-image-2058" &#47;&gt;
<h2>F&auml;rdigst&auml;lla en text&lt;&#47;h2&gt;<br />
Vi s&auml;ger att du vill &auml;ndra och dra runt punkterna som din text best&aring;r av, d&aring; beh&ouml;ver vi helt enkelt <strong>f&auml;rdigst&auml;lla den&lt;&#47;strong&gt;.<br />
&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan6.png" alt="" title="" width="700" height="365" class="alignnone size-full wp-image-2059" &#47;&gt;<br />
&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan7.png" alt="" title="" width="700" height="365" class="alignnone size-full wp-image-2060" &#47;&gt;<br />
&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan8.png" alt="" title="" width="700" height="365" class="alignnone size-full wp-image-2061" &#47;&gt;<br />
&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan9.png" alt="" title="" width="700" height="365" class="alignnone size-full wp-image-2062" &#47;&gt;<br />
&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan10.png" alt="" title="" width="700" height="365" class="alignnone size-full wp-image-2063" &#47;&gt;<br />
Nu kan du dra och omforma loggan precis som du vill ha den, perfekt om du vill g&ouml;ra om en bokstav till en f&aring;gel till exempel... Om det nu var en djuraff&auml;r som hade best&auml;llt den.
<h2>Exempel p&aring; smarta logotyper&lt;&#47;h2&gt;<br />
<a href="http:&#47;&#47;www.logofaves.com&#47;2010&#47;01&#47;spartan-golf-club-2&#47;" target="_blank">&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan112.png" alt="" title="" width="700" height="365" class="alignnone size-full wp-image-2067" &#47;&gt;&lt;&#47;a&gt;
<p><a href="http:&#47;&#47;www.logofaves.com&#47;2009&#47;09&#47;pause&#47;" target="_blank">&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan12.png" alt="" title="" width="700" height="229" class="alignnone size-full wp-image-2066" &#47;&gt;&lt;&#47;a&gt;
<p><a href="http:&#47;&#47;www.logofaves.com&#47;2009&#47;10&#47;gulp&#47;" target="_blank">&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan13.png" alt="" title="" width="700" height="365" class="alignnone size-full wp-image-2068" &#47;&gt;&lt;&#47;a&gt;
<p><a href="http:&#47;&#47;www.graphicleaf.se" target="_blank">&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan151.png" alt="Graphic Leaf" title="" width="700" height="365" class="alignnone size-full wp-image-2071" &#47;&gt;&lt;&#47;a&gt;
<p><a href="http:&#47;&#47;www.logofaves.com&#47;2009&#47;12&#47;antarctica&#47;" target="_blank">&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;09&#47;perfektaloggan14.png" alt="" title="" width="700" height="365" class="alignnone size-full wp-image-2069" &#47;&gt;&lt;&#47;a&gt;
<p><a href="http:&#47;&#47;dzineblog.com&#47;2010&#47;02&#47;45-creative-and-beautiful-logo-design-you-shouldve-seen.html" target="_blank">Du hittar fler fantastiska logotyper h&auml;r&lt;&#47;a&gt;
<h2>Slutsats&lt;&#47;h2&gt;<br />
Den perfekta loggan ska vara enkel men samtidigt unik i sitt slag, logotypen ska kunna representera det som f&ouml;retaget st&aring;r f&ouml;r och inte skapa f&ouml;rvirring. Att kombinera ett objekt med en text brukar ofta kunna ge ett positivt resultat, som pingvinen ovanf&ouml;r till exempel. H&auml;r &auml;r n&aring;gra punkter man kan t&auml;nka p&aring; n&auml;r man utvecklar loggan.
<h3>1. F&auml;rger&lt;&#47;h3&gt;<br />
F&auml;rg p&aring; loggan &auml;r ett plus, om loggan funkar i svart dessutom &auml;r det ett extra stort plus.<br />
T&auml;nk p&aring; att f&auml;rgerna ska st&auml;mma in i f&ouml;retagets grafiska profil.
<h3>2. Undvik detaljer&lt;&#47;h3&gt;<br />
F&ouml;r mycket detaljer skapar en f&ouml;rvirring, om det nu inte &auml;r det du vill g&ouml;ra f&ouml;rst&aring;s.
<h3>3. Stabilitet&lt;&#47;h3&gt;<br />
En stabil logga ger en trov&auml;rdighet hos f&ouml;retaget. Anv&auml;nd g&auml;rna tjocka fonter och inte f&ouml;rsta b&auml;sta font du hittar, testa m&aring;nga innan du best&auml;mmer dig!
<h3>4. Animering&lt;&#47;h3&gt;<br />
&Auml;r loggan gjord f&ouml;r att kunna animeras? F&ouml;retaget kanske sysslar mycket med animering och uppskattar det.
</h3></h3></h3></h3></h2></a></p></a></p></a></p></a></p></a></p></a></h2></strong></h2></h2></a></strong></h2></strong></h2></strong></p>
