<p>&lt;img src="&#47;wp-content&#47;uploads&#47;2013&#47;02&#47;ninja-temafunktioner.png" alt="" width="695" height="182" class="alignnone size-full wp-image-3537" &#47;&gt;</p>
<h1>Temafunktioner&lt;&#47;h1&gt;
<p>Vi har nu en komplett filstruktur, s&aring; l&aring;t oss b&ouml;rja att fylla n&aring;gra fler av dem.<br />
F&ouml;rst s&aring; kommer vi att l&auml;gga till n&aring;gra PHP-funktioner i v&aring;rat tema, dessa kommer att fylla n&aring;gra olika behov, bland annat:</p>
<ul>
<li>
<p>&raquo; L&auml;gga till st&ouml;d f&ouml;r Wordpress funktioner s&aring; som egna bakgrunder, headers, post-format, etc.&lt;&#47;p&gt;&lt;&#47;li&gt;</p>
<li>
<p>&raquo; L&auml;gga till default-v&auml;rden f&ouml;r temat.&lt;&#47;p&gt;&lt;&#47;li&gt;</p>
<li>
<p>&raquo; Fungera som "containers" f&ouml;r koden som vi kan &aring;teranv&auml;nda i hela temat.&lt;&#47;p&gt;&lt;&#47;li&gt;<br />
&lt;&#47;ul&gt;</p>
<p>Filer som vi kommer att &auml;ndra eller skapa i detta kapitlet: </p>
<ul>
<li>
<p><strong>functions.php&lt;&#47;strong&gt;&lt;&#47;p&gt;&lt;&#47;li&gt;
<li>
<p><strong>inc&#47;template-tags.php&lt;&#47;strong&gt;&lt;&#47;p&gt;&lt;&#47;li&gt;
<li>
<p><strong>inc&#47;tweaks.php&lt;&#47;strong&gt;&lt;&#47;p&gt;&lt;&#47;li&gt;<br />
&lt;&#47;ul&gt;&lt;br&#47;&gt;
<h2>Exempel&lt;&#47;h2&gt;<br />
Om du &auml;r ny p&aring; PHP, t&auml;nk dig att en funktion &auml;r som en maskin som utf&ouml;r en specifik syssla, n&auml;r det beh&ouml;vs.<br />
Vi definierar en funktion som f&ouml;ljer:<br />
[php]<br />
function my_function() {<br />
  ...Inneh&aring;llet i funktionen<br />
}<br />
[&#47;php]<br />
Efter att vi har definierat en funktion, s&aring; kan vi anropa den i v&aring;ra tema-filer n&auml;r vi beh&ouml;ver utf&ouml;ra dess syssla. Ett funktionsanrop kan vara s&aring; simpelt som att skriva funktionsnamnet och ett semikolon:
<p>[php]</p>
<div>
    <?php my_function(); ?><br />
&lt;&#47;div&gt;<br />
[&#47;php]
<p>Andra funktionsanrop &auml;r n&aring;got mer komplexa:</p>
<p>[php]</p>
<div>
    <?php my_second_function( 'parameter 1', 'parameter 2' ); ?><br />
&lt;&#47;div&gt;<br />
[&#47;php]
<p>I exemplet ovan s&aring; skickar vi tv&aring; parametrar till v&aring;ran funktion. Parametrar &auml;r en typ av variabler som du skickar till funktionen. Funktionen anv&auml;nder sen dessa f&ouml;r att producera slutresultatet.<br />
I v&aring;rat tema kommer vi att anropa t&auml;mligen m&aring;nga funktioner.</p>
<h2>Functions.php&lt;&#47;h2&gt;
<p>I tema-mappen som du skapade i f&ouml;rra kapitlet, &ouml;ppna filen <strong>functions.php&lt;&#47;strong&gt;.<br />
I b&ouml;rjan av den, kopiera in f&ouml;ljande:
<p>[php]<br />
&lt;?php<br />
&#47;**<br />
 * Ninja funktioner &amp; definitioner<br />
 *<br />
 * @package Ninja<br />
 * @since Ninja 1.0<br />
 *&#47;<br />
[&#47;php]</p>
<p>H&auml;r b&ouml;rjar vi filen med &ouml;ppnings-taggen f&ouml;r PHP, <em>&lt;?php&lt;&#47;em&gt;.
<p>Efter det s&aring; har vi n&aring;gra kommentarer, en kort beskrivning av filen, samt vilket tema den tillh&ouml;r.</p>
<p>Till skillnad fr&aring;n HTML s&aring; finns det tv&aring; olika typer av kommentarer i PHP. En f&ouml;r enskilda rader och en f&ouml;r flera rader. Flerradiga kommentarer b&ouml;rjar med &#47;* och slutar med *&#47;, medan kommentarer p&aring; enskilda rader b&ouml;rjar med tv&aring; &#47;, dvs &#47;&#47;. PHP ignorerar kommentarerna, s&aring; dom &auml;r v&auml;ldigt anv&auml;ndbara f&ouml;r dokumentation i koden.</p>
<h2>$content_width&lt;&#47;h2&gt;
<p>$content_width &auml;r en global variabel som s&auml;tter max-bredden p&aring; saker, s&aring; som upladdade bilder i ditt tema. Det f&ouml;rebygger att stora bilder blir f&ouml;r stora f&ouml;r hemsidan. $content_width b&ouml;r s&auml;ttas till samma bredd som v&aring;ran huvud-container f&ouml;r inneh&aring;ll &auml;r. I v&aring;ran HTML struktur &auml;r det #content. Vi kommer att anv&auml;nda CSS f&ouml;r att s&auml;tta bredden p&aring; denna, men d&aring; vi inte har kommit till CSS delen &auml;n s&aring; s&auml;tter vi $content_width till 654px bred.</p>
<p>I <strong>functions.php&lt;&#47;strong&gt;, klistra nu in f&ouml;ljande:<br />
[php]<br />
&#47;**<br />
 * S&auml;tt bredden baserat p&aring; temats design and css.<br />
 *<br />
 * @since Ninja 1.0<br />
 *&#47;<br />
if ( ! isset( $content_width ) ){ $content_width = 654; &#47;* pixlar *&#47; }<br />
[&#47;php]
<p>Nu har vi allts&aring; definierat $content_width. PHP variabler har ett dollartecken ("$") innan deras namn och ett semi-kolon efter dess v&auml;rde.</p>
<h2>ninja_setup()&lt;&#47;h2&gt;
<p>Som n&auml;sta steg ska vi skapa en funktion som skapar default-v&auml;rdena f&ouml;r temat och ber&auml;ttar f&ouml;r Wordpress att temat st&ouml;djer diverse funktioner. Hoppa &ouml;ver en rad efter $content_width deklarationen och l&auml;gg till detta: </p>
<p>[php]<br />
if ( ! function_exists( 'ninja_setup' ) ):<br />
&#47;**<br />
 * S&auml;tter upp default-v&auml;rden f&ouml;r temat och registerar diverse Wordpress funktioner.<br />
 *<br />
 * @since Ninja 1.0<br />
 *&#47;<br />
function ninja_setup() {</p>
<p>    &#47;**<br />
     * Egna template-tags f&ouml;r temat<br />
     *&#47;<br />
    require( get_template_directory() . '&#47;inc&#47;template-tags.php' );</p>
<p>    &#47;**<br />
     * Egna funktioner som fungerar oavsett tema-template<br />
     *&#47;<br />
    require( get_template_directory() . '&#47;inc&#47;tweaks.php' );</p>
<p>    &#47;**<br />
     * L&auml;gg till default post och rss l&auml;nkar till <head><br />
     *&#47;<br />
    add_theme_support( 'automatic-feed-links' );
<p>    &#47;**<br />
     * L&auml;gg till support f&ouml;r Aside Post Format<br />
     *&#47;<br />
    add_theme_support( 'post-formats', array( 'aside' ) );</p>
<p>    &#47;**<br />
     * L&auml;gg till support f&ouml;r en meny som anropas via wp_nav_menu().<br />
     *&#47;<br />
    register_nav_menus( array(<br />
        'primary' =&gt; __( 'Primary Menu', 'shape' ),<br />
    ) );<br />
}<br />
endif; &#47;&#47; ninja_setup<br />
add_action( 'after_setup_theme', 'ninja_setup' );<br />
[&#47;php]</p>
<p>Denna koden &auml;r v&auml;l kommenterad, s&aring; att du kan f&aring; en bra id&eacute; av vad den g&ouml;r. Som du ser &auml;r det mest funktions-anrop. F&ouml;r dig som &auml;r intresserad av vad vi just har klistrat in s&aring; t&auml;nkte vi g&aring; igenom det lite snabbt.</p>
<p>Vi anropar tv&aring; filer som kommer att finnas i v&aring;ran inc&#47; mapp, template-tags.php och tweaks.php. Vi skapar dessa filer senare i kursen.</p>
<p>Efter det s&aring; anropar vi tv&aring; funktioner som l&auml;gger till st&ouml;d f&ouml;r RSS feeds i <head>, och f&ouml;r n&aring;got som kallas Aside Post Format. Den sista funktionen registrerar en navigations meny, som vi kommer att anv&auml;nda f&ouml;r v&aring;ran huvudmeny. 
<p>Till sist s&aring; avslutar vi funktionen med ett }, och kallar det i v&aring;rat tema genom att "haka p&aring;" en annan wordpress funktion.</p>
<p>[php]<br />
add_action( 'after_setup_theme', 'ninja_setup' );<br />
[&#47;php]</p>
<p>I enklare termer, s&aring; s&auml;ger vi &aring;t Wordpress att anropa ninja_setup() n&auml;r det k&ouml;r after_setup_theme() funktionen.</p>
<p>Senare i kursen kommer vi att l&auml;gga till mer saker till functions.php, men just nu s&aring; &auml;r vi klara med den.</p>
<h2>Template-tags.php and Tweaks.php&lt;&#47;h2&gt;
<p>Tidigare i kapitlet s&aring; anv&auml;nde vi f&ouml;ljande kod i functions.php:</p>
<p>[php]<br />
&#47;**<br />
     * Custom template tags for this theme.<br />
     *&#47;<br />
    require( get_template_directory() . '&#47;inc&#47;template-tags.php' );</p>
<p>    &#47;**<br />
     * Custom functions that act independently of the theme templates<br />
     *&#47;<br />
    require( get_template_directory() . '&#47;inc&#47;tweaks.php' );<br />
[&#47;php]</p>
<p>Nu ska vi fylla i dom filerna. Skapa filerna <strong>template-tags.php&lt;&#47;strong&gt; och <strong>tweaks.php&lt;&#47;strong&gt; i din "inc" mapp.
<h2>template-tags.php&lt;&#47;h2&gt;
<p>En template-tag &auml;r en wordpress funktion som du anropar fr&aring;n ditt tema, och som visar dynamisk data.<br />
Kopiera in f&ouml;ljande i <strong>template-tags.php&lt;&#47;strong&gt;:
<p>[php]<br />
&lt;?php<br />
&#47;**<br />
 * Template-tags.<br />
 *<br />
 *<br />
 * @package Ninja<br />
 * @since Ninja 1.0<br />
 *&#47;<br />
[&#47;php]</p>
<h2>tweaks.php &lt;&#47;h2&gt;
<p>I tweaks.php placerar vi funktioner som g&ouml;r v&aring;rat tema b&auml;ttre, genom att modifiera existerande wordpress-funktioner.<br />
Kopiera in f&ouml;ljande i <strong>tweaks.php&lt;&#47;strong&gt;:<br />
[php]<br />
&lt;?php<br />
&#47;**<br />
 * Egna funktioner som agerar oavsett mallar.<br />
 * @package Ninja<br />
 * @since Ninja 1.0<br />
 *&#47;<br />
[&#47;php]
<p>Kopiera sedan in f&ouml;ljande kod i samma fil:</p>
<p>[php]<br />
&#47;**<br />
 * F&aring; v&aring;ran wp_nav_menu() fallback, wp_page_menu(), att visa en "Hem" l&auml;nk.<br />
 *<br />
 * @since Ninja 1.0<br />
 *&#47;<br />
function ninja_page_menu_args( $args ) {<br />
    $args['show_home'] = true;<br />
    return $args;<br />
}<br />
add_filter( 'wp_page_menu_args', 'ninja_page_menu_args' );</p>
<p>&#47;**<br />
 * L&auml;gg till egna classes till body-classerna..<br />
 *<br />
 * @since Ninja 1.0<br />
 *&#47;<br />
function ninja_body_classes( $classes ) {<br />
    if ( is_multi_author() ) {<br />
        $classes[] = 'group-blog';<br />
    }</p>
<p>    return $classes;<br />
}<br />
add_filter( 'body_class', 'ninja_body_classes' );</p>
<p>&#47;**<br />
 * Filtrera en l&auml;nk till ett content ID f&ouml;r n&auml;sta&#47;f&ouml;reg&aring;ende bild p&aring; sidor f&ouml;r bilagor.<br />
 * @since Ninja 1.0<br />
 *&#47;<br />
function ninja_enhanced_image_navigation( $url, $id ) {<br />
    if ( ! is_attachment() &amp;&amp; ! wp_attachment_is_image( $id ) )<br />
        return $url;</p>
<p>    $image = get_post( $id );<br />
    if ( ! empty( $image-&gt;post_parent ) &amp;&amp; $image-&gt;post_parent != $id )<br />
        $url .= '#main';</p>
<p>    return $url;<br />
}<br />
add_filter( 'attachment_link', 'ninja_enhanced_image_navigation', 10, 2 );<br />
[&#47;php]</p>
</strong></p></h2></strong></p></h2></strong></strong></p></h2></head></p></head></p></h2></strong></p></h2></em></p></strong></p></h2></div></div></h2></strong></p></li></strong></p></li></strong></p></li></ul></li></li></li></ul></h1>
