<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;11&#47;07_Salvio_Hexia.jpg" alt="" &#47;&gt;</p>
<p>Idag g&auml;star Alex oss med en schysst guide p&aring; hur du kan f&ouml;rvandla ett ljus till vatten i Photoshop.<br />
F&ouml;r att t&auml;nda ett <strong>vattenljus &lt;&#47;strong&gt;&auml;r det bra med grundl&auml;ggande kunskaper i Photoshop.
<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;11&#47;01_Accio.jpg" alt="" &#47;&gt;</p>
<p>Till att b&ouml;rja med beh&ouml;ver du ett foto p&aring; ett Ljus.<br />
Det &auml;r viktigt att kortet har en&nbsp;<strong>enf&auml;rgad bakgrund&lt;&#47;strong&gt; och allra helst en <strong>gr&aring; bakgrund&lt;&#47;strong&gt;.
<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;11&#47;02_Lumos.jpg" alt="" &#47;&gt;</p>
<p>Anv&auml;nd en <strong>snabb slutartid&lt;&#47;strong&gt; och <strong>blixten &lt;&#47;strong&gt;n&auml;r du tar kort p&aring; rinnande vatten. F&ouml;rs&ouml;k att f&aring; vattnet i formen som p&aring; bilden d&aring; det liknar en eldsl&aring;ga, &auml;ven h&auml;r &auml;r det viktigt med en <strong>gr&aring; bakgrund&lt;&#47;strong&gt;.
<p>L&auml;gg sedan in bilderna i Photoshop och med <strong>penseln&lt;&#47;strong&gt; fril&auml;gger du vattnet fr&aring;n bakgrunden. Kopiera, klistra och sudda f&ouml;r att forma vattnet som en l&aring;ga.
<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;11&#47;03_Incendio.jpg" alt="" &#47;&gt;</p>
<p>Skapa ett justeringslager med&nbsp;<strong>svartvitt filter&lt;&#47;strong&gt; f&ouml;r att sortera bort potentiella missf&auml;rgningar. Duplicera bilden med ljuset p&aring; och ange effekterna "<strong>t&auml;cka &ouml;ver&lt;&#47;strong&gt;" och "<strong>efterbel. f&auml;rg&lt;&#47;strong&gt;" p&aring; de tv&aring; kopiorna<em>.&lt;&#47;em&gt;
<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;11&#47;04_Reducio.jpg" alt="" &#47;&gt;</p>
<p>Bilden b&ouml;r se ut n&aring;got s&aring;dant h&auml;r</p>
<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;11&#47;05_Finite_Incantatem.jpg" alt="" &#47;&gt;</p>
<p>G&ouml;r ett <strong>nytt lager&lt;&#47;strong&gt; ovanf&ouml;r de andra och pensla &ouml;ver det &ouml;verfl&ouml;diga vattnet, anv&auml;nd pipetten, smeta ut och penseln f&ouml;r att g&ouml;ra en disorterad veke <em>(vattnets illusion)&lt;&#47;em&gt; eller g&ouml;r det p&aring; ditt eget s&auml;tt.
<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;11&#47;06_Alohomora.jpg" alt="" &#47;&gt;</p>
<p>L&auml;gg p&aring; ett nytt lager ovanf&ouml;r alla andra, helbl&aring;tt med lagereffekten "<strong>F&auml;rg&lt;&#47;strong&gt;".
<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;11&#47;07_Salvio_Hexia.jpg" alt="" &#47;&gt;</p>
<p><strong>Gl&ouml;m inte sl&auml;cka ljusen!&lt;&#47;strong&gt;<br />
<em>Det kan bli &ouml;versv&auml;mning annars - Alex&lt;&#47;em&gt;
</em></strong></p></strong></p></em></strong></p></em></strong></strong></strong></p></strong></p></strong></strong></strong></p></strong></strong></p></strong></p>
