<p>&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;07&#47;nyborjare-html-css.png" alt="Nyb&ouml;rjare html css" width="695" height="213" class="alignnone size-full wp-image-4081" &#47;&gt;</p>
<h1>Nyb&ouml;rjare: HTML &amp; CSS&lt;&#47;h1&gt;<br />
<strong>Har du funderat p&aring; hur man skapar en hemsida utan n&aring;gra gratis-tj&auml;nster p&aring; n&auml;tet?<br />
<span style="color: #e449be;">Perfekt! D&aring; har vi kursen f&ouml;r dig.&lt;&#47;span&gt;&lt;&#47;strong&gt;
<p>Att skriva en hemsida fr&aring;n grunden &auml;r j&auml;ttel&auml;tt och vi t&auml;nker visa allt steg f&ouml;r steg. Om du har n&aring;gra fr&aring;gor beh&ouml;ver du bara kommentera kapitlet du befinner dig p&aring;, s&aring; hj&auml;lper vi dig personligen! Du hittar &auml;ven extramaterial i v&aring;r <a href="&#47;blogg&#47;">blogg&lt;&#47;a&gt; d&auml;r vi l&auml;gger upp tips och guider. Sedan f&aring;r du sj&auml;lvklart <a href="&#47;kontakt&#47;" target="_blank">skicka fr&aring;gor&lt;&#47;a&gt; till oss s&aring; besvarar vi dom. Med det sagt s&aring; hoppas vi att du finner oss hj&auml;lpsamma i dina f&ouml;rsta steg som webbdesigner!&lt;br&#47;&gt;&lt;br&#47;&gt;
<h2>&lt;img class="alignnone size-full wp-image-176" src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;07&#47;laddaner6.png" alt="" width="18" height="18" &#47;&gt;&nbsp;Ladda ner&lt;&#47;h2&gt;
<h3>Texthanterare&lt;&#47;h3&gt;<br />
Med texthanteraren skriver vi sidans inneh&aring;ll, ungef&auml;r som Microsoft Word men f&ouml;r hemsidor kan man s&auml;ga.<br />
Ladda ner&nbsp;<a href="http:&#47;&#47;www.sublimetext.com&#47;2" target="_blank">Sublime Text 2&lt;&#47;a&gt;&nbsp;vilket &auml;r delvis gratis d&aring; man m&aring;ste betala f&ouml;r fortsatt anv&auml;ndning.&nbsp;Om du hellre f&ouml;redrar ett gratis program s&aring; g&aring;r&nbsp;<a href="http:&#47;&#47;notepad-plus-plus.org&#47;download&#47;v6.1.5.html" target="_blank">Notepad++&lt;&#47;a&gt;&nbsp;lika bra<strong>.&lt;&#47;strong&gt;
<h2>&lt;img class="alignnone size-full wp-image-177" src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;07&#47;bra1.png" alt="" width="18" height="18" &#47;&gt;&nbsp;Bra att ha (men inte ett m&aring;ste)&lt;&#47;h2&gt;
<h3>1. Webbhotell&lt;&#47;h3&gt;<br />
F&ouml;r att kunna publicera din kommande hemsida beh&ouml;vs ett webbhotell som erbjuder dig utrymme att ladda upp den. Webbhotell kan kosta s&aring; lite som 12kr per m&aring;nad, d&auml;remot r&ouml;r det sig om h&ouml;gre summor om du vill ha&nbsp;kvalitet. <a title="Hur v&auml;ljer man webbhotell?" href="http:&#47;&#47;webbdesignkurser.se&#47;webbhotell&#47;" target="_blank">H&auml;r&lt;&#47;a&gt; hittar du tips p&aring; hur man v&auml;ljer hotell. Vi kommer senare i kursen att hj&auml;lpa dig publicera hemsidan via webbhotellet.
<h3>2. Dom&auml;n&lt;&#47;h3&gt;<br />
Det r&auml;cker inte med webbhotell, ett <a href="http:&#47;&#47;webbdesignkurser.se&#47;domannamn&#47;" target="_blank">dom&auml;nnamn&lt;&#47;a&gt; kr&auml;vs ocks&aring; f&ouml;r att namnge din hemsida. M&aring;nga webbhotell erbjuder dom&auml;n n&auml;r du k&ouml;per utrymme hos dem. N&auml;r du k&ouml;per dom&auml;n kan du v&auml;lja mellan m&aring;nga olika topp-dom&auml;ner, till exempel .com .se .nu och s&aring; vidare.
<h3>3. Bildhanteringsprogramvara&lt;&#47;h3&gt;<br />
Vi rekommenderar att du har Photoshop installerat f&ouml;r att kunna utveckla dina spetskunskaper ytterligare.<br />
Photoshop k&ouml;per du hos&nbsp;<a href="http:&#47;&#47;success.adobe.com&#47;sv&#47;se&#47;sem&#47;products&#47;photoshop.html?sdid=JTAEP&amp;skwcid=TC|22760|ladda%20ner%20photoshop||S|b|12973245410" target="_blank">adobe.com&lt;&#47;a&gt;&nbsp;(trial finns att ladda ner). I kursen "Kunnig" kommer vi att g&aring; in djupare p&aring; Photoshop.<br />
Om du ist&auml;llet letar efter ett gratisalternativ s&aring; &auml;r GIMP ett ytterst kompetent verktyg som g&aring;r utm&auml;rkt att anv&auml;nda, och liknar Photoshop.
</a></h3></a></h3></a></h3></h2></strong></a></a></h3></h2></a></a></p></span></strong></h1>
