<p>&lt;img src="&#47;wp-content&#47;uploads&#47;2013&#47;02&#47;utvecklingsverktyg.png" alt="" width="695" height="182" class="alignnone size-full wp-image-3393" &#47;&gt;</p>
<h1>Utvecklingsverktyg&lt;&#47;h1&gt;
<p>Innan vi b&ouml;rjar med att skapa ett wordpress-tema beh&ouml;ver vi vissa verktyg.&lt;br&#47;&gt;&lt;br&#47;&gt;</p>
<h2>Ett webbhotell eller server&lt;&#47;h2&gt;<br />
F&ouml;r att Wordpress ska fungera kr&auml;vs en server eller ett webhotell med st&ouml;d f&ouml;r PHP och MySQL. I denna kurs kommer vi att g&aring; igenom hur du anv&auml;nder ett webbhotell, men du kan &auml;ven g&ouml;ra detta p&aring; en lokal server p&aring; din dator, med tex XAMPP eller MAMP. F&ouml;r att utveckla ett wordpress tema p&aring; ett webbhotell beh&ouml;ver du en tillg&aring;ng till FTP. F&ouml;r mer information om FTP, se <a href="&#47;nyborjare-publicera&#47;" target="_blank">h&auml;r.&lt;&#47;a&gt;
<p>N&auml;r du har anslutit till din sida &auml;r du redo f&ouml;r att installera Wordpress.</p>
<h2>Wordpress&lt;&#47;h2&gt;<br />
&lt;img src="&#47;wp-content&#47;uploads&#47;2013&#47;02&#47;ninja-wordpress-f&ouml;rhandvisning.png" alt="" width="695" height="227" class="alignnone size-full wp-image-3584" &#47;&gt;<br />
F&ouml;r att installera Wordpress s&aring; beh&ouml;ver du ladda ner den senaste versionen och ladda upp den till ditt webbhotell. F&ouml;r mer info om hur du g&aring;r till v&auml;ga, se <a href="&#47;installera-wordpress&#47;" target="_blank">Installera WordPress.&lt;&#47;a&gt;
<h2>Exempeldata&lt;&#47;h2&gt;<br />
Din Wordpress installation kommer att beh&ouml;va exempeldata, utfyllnad, eller liknande. I Wordpress admin-panelen, g&aring; till <em>Verktyg -&gt; Importera&lt;&#47;em&gt; och v&auml;lj Wordpress fr&aring;n listan av alternativ. Nu beh&ouml;ver vi bara en WXR fil att importera.<br />
N&aring;gra alternativ &auml;r:<br />
<a href="http:&#47;&#47;codex.wordpress.org&#47;Theme_Unit_Test">The Theme Unit Test data&lt;&#47;a&gt;<br />
<a href="http:&#47;&#47;wpcandy.com&#47;articles&#47;easier-theme-development-with-the-sample-post-collection.html">WPCandy Sample Content&lt;&#47;a&gt;
<p>Dessa filer inneh&aring;ller olika data f&ouml;r att anv&auml;nda som utfyllnad innan du har riktiga poster och dylikt p&aring; din sida. Det kan vara en bra ide att l&auml;gga till lite egen data ocks&aring;, s&aring; att du kan se hur slutresultet blir.</p>
<h2>En texthanterare&lt;&#47;h2&gt;<br />
Du beh&ouml;ver inga speciella bildhanteringsprogram eller liknande f&ouml;r att skapa ett wordpresstema, en vanlig texthanterare r&auml;cker. Vi rekommenderar <a href="http:&#47;&#47;www.sublimetext.com&#47;2" target="_blank">Sublime Text 2&lt;&#47;a&gt;&nbsp;vilket &auml;r delvis gratis d&aring; man m&aring;ste betala f&ouml;r fortsatt anv&auml;ndning.&nbsp;Om du hellre f&ouml;redrar ett gratis program s&aring; g&aring;r&nbsp;<a href="http:&#47;&#47;notepad-plus-plus.org&#47;download&#47;v6.1.5.html" target="_blank">Notepad++&lt;&#47;a&gt;&nbsp;lika bra<strong>.&lt;&#47;strong&gt;
<h2>HTML och CSS&lt;&#47;h2&gt;<br />
F&ouml;r att skapa ett wordpress-tema beh&ouml;ver du ha n&aring;gorlunda kunskaper i HTML och CSS. Du kan l&auml;ra dig detta i v&aring;ra tidigare kapitel, <a href="&#47;nyborjare-inledning&#47;">Nyb&ouml;rjare&lt;&#47;a&gt; och <a href="&#47;kunnig-inledning&#47;">Kunnig&lt;&#47;a&gt;.
<h2>PHP&lt;&#47;h2&gt;<br />
F&ouml;r att skapa ett Wordpress-tema beh&ouml;ver du &auml;ven kunna en del PHP, vilket du kommer att f&aring; l&auml;ra dig i denna kursen. 
</h2></a></a></h2></strong></a></a></h2></a></a></em></h2></a></h2></a></h2></h1>
