<h1>Vanliga fr&aring;gor&lt;&#47;h1&gt;<br />
&lt;img src="http:&#47;&#47;webbdesignkurser.se&#47;wp-content&#47;uploads&#47;2012&#47;07&#47;fragor.jpg" alt="Vanliga fr&aring;gor" width="700" height="467" class="alignnone size-full wp-image-4008" style="width:100%; height:auto;"&#47;&gt;
<div class="twelve columns" style="height:10px;">&lt;&#47;div&gt;
<h3>F&aring;r jag ocks&aring; skriva kurser?&lt;&#47;h3&gt;<br />
Sj&auml;lvklart! Vi letar alltid efter nya webbintresserade som vill bidra till nya kurser. Om du brinner f&ouml;r att skapa webb-relaterat kursmaterial och k&auml;nner att du &auml;r bra p&aring; det dessutom, s&aring; <a href="&#47;kontakt&#47;">Kontakta oss&lt;&#47;a&gt; g&auml;rna. Du &auml;r varmt v&auml;lkommen!
<div class="twelve columns" style="height:10px;">&lt;&#47;div&gt;
<h3>Hur skapar man en hemsida?&lt;&#47;h3&gt;<br />
Hemsidor &auml;r uppbyggda av ren text, sparade i sm&aring; filer som man laddar upp p&aring; sitt webbhotell. Dom h&auml;r texterna kan till exempel vara skrivna i ett spr&aring;k kallat HTML. Med HTML kan man h&auml;mta in bilder och texter p&aring; hemsidan, samt skapa l&auml;nkar till andra filer. F&ouml;r att f&aring; st&ouml;rre inblick p&aring; hur en hemsida kan vara uppbyggd kan du h&ouml;gerklicka p&aring; en hemsida f&ouml;r att visa k&auml;llkoden, d&aring; dyker dom h&auml;r texterna upp. Vill du l&auml;ra dig mer hur man verkligen skapar en hemsida kan du f&ouml;lja v&aring;r nyb&ouml;rjarkurs i <a href="&#47;nyborjare-inledning&#47;">HTML &amp; CSS&lt;&#47;a&gt;.
<div class="twelve columns" style="height:10px;">&lt;&#47;div&gt;
<h3>WYSIWYG-Program?&lt;&#47;h3&gt;<br />
WYSIWYG st&aring;r f&ouml;r What You See Is What You Get, det vill s&auml;ga program som hj&auml;lper dig skapa hemsidor med hj&auml;lp av visuella verktyg. Det &auml;r inget vi rekommenderar, men det &auml;r s&aring;klart en smaksak. Dreamviewer &auml;r ett exempel p&aring; WYSIWYG-program, vilket ger dig b&aring;de en visuell redigerare och m&ouml;jlighet till att skriva direkt i koden.
<div class="twelve columns" style="height:10px;">&lt;&#47;div&gt;
<h3>Vad &auml;r copyright?&lt;&#47;h3&gt;<br />
Copyright, eller upphovsr&auml;tt som det heter p&aring; svenska, anv&auml;nds f&ouml;r att ge den person som skapat n&aring;got av verksh&ouml;jd ensamr&auml;tt &ouml;ver materialet. Att kopiera copyright-skyddat material bryter mot lagen vilket kan resultera i skadest&aring;nd.
<div class="twelve columns" style="height:10px;">&lt;&#47;div&gt;
<h3>Jag f&aring;r en massa konstiga tecken ist&auml;llet f&ouml;r &aring;, &auml; och &ouml;?&lt;&#47;h3&gt;<br />
Det beror p&aring; kodningen p&aring; din hemsida. Du m&aring;ste ber&auml;tta f&ouml;r hemsidan att det &auml;r svenska som g&auml;ller.<br />
<strong>L&auml;gg in det h&auml;r inom <head>:&lt;&#47;strong&gt;
<p>[html]<br />
<meta charset="utf-8" /><br />
[&#47;html]&lt;br&#47;&gt;</p>
<div class="twelve columns" style="height:5px;">&lt;&#47;div&gt;
<h3 id="explorer">Hemsidan ser konstig ut i Explorer?&lt;&#47;h3&gt;<br />
Du &auml;r inte ensam, det &auml;r inte ovanligt att Explorer ska kasta om allt. Kolla s&aring; att du har f&ouml;ljande doctype-kod l&auml;ngst upp p&aring; sidan. Det h&auml;r ber&auml;ttar f&ouml;r webbl&auml;saren att du skriver i HTML5.
<p>[html]<br />
&lt;!DOCTYPE html&gt;<br />
[&#47;html]&lt;br&#47;&gt;</p>
<div class="twelve columns" style="height:5px;">&lt;&#47;div&gt;
<h3>Hur v&auml;ljer jag webbhotell?&lt;&#47;h3&gt;<br />
Vi &auml;r en oberoende tj&auml;nst n&auml;r det g&auml;ller val av webbhotell och kan inte ge n&aring;gra f&ouml;rslag. D&auml;remot f&aring;r du g&auml;rna l&auml;sa v&aring;rat kapitel om <a href="&#47;webbhotell&#47;">webbhotell&lt;&#47;a&gt; f&ouml;r att veta mer vad man ska t&auml;nka p&aring; n&auml;r man v&auml;ljer.
<div class="twelve columns" style="height:10px;">&lt;&#47;div&gt;
<h3>Hur kan jag &ouml;ka trafiken p&aring; sidan?&lt;&#47;h3&gt;<br />
Sociala medier &auml;r ett bra alternativ. Skapa en social sida f&ouml;r din hemsida och bjud in m&auml;nniskor till den f&ouml;r att l&auml;ttare skapa ett n&auml;tverk. Ett annat alternativ &auml;r att anv&auml;nda sig av reklamtj&auml;nster f&ouml;r att n&aring; ut till fler.
</h3></div></a></h3></div></h3></div></head></strong></h3></div></h3></div></h3></div></a></h3></div></a></h3></div></h1>
